<a href="https://colab.research.google.com/github/fabiobasson/python_dataanalysis_book/blob/main/python_dataanalysis_chapter01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd;

In [76]:
names_1880 = pd.read_csv('yob1880.txt',names=['Nomes','Sexo','Aniversario'])

In [ ]:
names_1880.head ()

       Nomes Sexo  Aniversario
0       Mary    F         7065
1       Anna    F         2604
2       Emma    F         2003
3  Elizabeth    F         1939
4     Minnie    F         1746

In [ ]:
names_1880

          Nomes Sexo  Aniversario
0          Mary    F         7065
1          Anna    F         2604
2          Emma    F         2003
3     Elizabeth    F         1939
4        Minnie    F         1746
...         ...  ...          ...
1995     Woodie    M            5
1996     Worthy    M            5
1997     Wright    M            5
1998       York    M            5
1999  Zachariah    M            5

[2000 rows x 3 columns]

In [ ]:
names_1880.groupby('Sexo').Aniversario.sum()

Sexo
F     90994
M    110490
Name: Aniversario, dtype: int64

In [72]:
years=range(1902,2011)
pieces=[]
columns = ['Nome', 'Sexo', 'Aniversario']

In [73]:
for year in years:
  path='names/yob%d.txt'  % year
  frame = pd.read_csv(path,names=columns)

  frame['year'] = year
  pieces.append(frame)

  names = pd.concat(pieces,ignore_index=True)

In [ ]:
names

              Nome Sexo  Aniversario  year
0             Mary    F         7065  1879
1             Anna    F         2604  1879
2             Emma    F         2003  1879
3        Elizabeth    F         1939  1879
4           Minnie    F         1746  1879
...            ...  ...          ...   ...
1248715      White    M            5  2010
1248716    Wilhelm    M            5  2010
1248717   Winifred    M            5  2010
1248718     Woodie    M            5  2010
1248719       Zeno    M            5  2010

[1248720 rows x 4 columns]

In [80]:
def add_prop(group):
  Aniversario = group.Aniversario.astype(float)
  group['prop']=Aniversario/Aniversario.sum()
  return group

In [82]:
names = names.groupby(['year', 'Sexo']).apply(add_prop)

In [83]:
names

              Nome Sexo  Aniversario  year      prop
0             Mary    F        14486  1902  0.054856
1            Helen    F         5967  1902  0.022596
2             Anna    F         5288  1902  0.020025
3         Margaret    F         5011  1902  0.018976
4             Ruth    F         4384  1902  0.016601
...            ...  ...          ...   ...       ...
1633103    Zymaire    M            5  2010  0.000003
1633104     Zyonne    M            5  2010  0.000003
1633105  Zyquarius    M            5  2010  0.000003
1633106      Zyran    M            5  2010  0.000003
1633107      Zzyzx    M            5  2010  0.000003

[1633108 rows x 5 columns]

In [134]:
def get_top1000(group):
  return group.sort_index(level='Aniversario',ascending=False)[:3]

In [135]:
grouped = names.groupby(['year', 'Sexo'])

In [136]:
top1000 = grouped.apply(get_top1000)

In [137]:
top1000

                        Nome Sexo  Aniversario  year      prop
year Sexo
1902 F    2041        Zellie    F            5  1902  0.000019
          2040       Yolande    F            5  1902  0.000019
          2039         Wylma    F            5  1902  0.000019
     M    3361        Zollie    M            5  1902  0.000041
          3360         Yancy    M            5  1902  0.000041
...                      ...  ...          ...   ...       ...
2010 F    1618844    Zyriana    F            5  2010  0.000003
          1618843    Zyonnah    F            5  2010  0.000003
     M    1633107      Zzyzx    M            5  2010  0.000003
          1633106      Zyran    M            5  2010  0.000003
          1633105  Zyquarius    M            5  2010  0.000003

[654 rows x 5 columns]